# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня
res, res_finish = int(input()), int(input())
day = 1

while res < res_finish:
    day += 1
    res += res * 0.1

print(f'День: {day}')
